Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.IsEqual(Autodesk.Revit.DB.PointClouds.PointCloudColorSettings)
Check if the contents of two settings are equal.
other:
The settings to be compared.
Returns:
True for equal, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.Assign(Autodesk.Revit.DB.PointClouds.PointCloudColorSettings)
Assigns values of the source settings to this object.
other:
The source settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.Color2
Color 2
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.Color1
Color 1
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.#ctor(Autodesk.Revit.DB.PointClouds.PointCloudColorSettings)
Constructs a copy of source object.
other:
Source object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.#ctor(Autodesk.Revit.DB.Color,Autodesk.Revit.DB.Color)
Constructs color settings object from given colors.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.#ctor(Autodesk.Revit.DB.PointCloudColorMode)
Constructs color settings object with default color for given color mode.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.#ctor
Constructs color settings object with default colors.
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudColorSettings
The color settings which are applied to a PointCloudInstance element, or one of its scans.
Remarks:
For different color modes (PointCloudColorMode), the color settings mean different things:
for single color, color1 means the display colorfor other modes (intensity, elevation), color1 and color2 form a gradient from min to maxfor no overrides and normals, color1 and color2 are not used
Since:
2014